tests/Functional/fixtures/client_version_request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><clientVersion xmlns="http://developer.intuit.com/"><strVersion>2.3.0.25</strVersion></clientVersion></soap:Body></soap:Envelope>